Repository: InitialInfinity/CityMarine
Catalog: ibillcraft/Resources/Views/CompanyDetails/EditIndex.*.resx
Languages: de_de

source: Address
de_de: Adresse

source: Bank Account Number
de_de: Kontonummer

source: Branch IFSC
de_de: Zweigstelle IFSC

source: Branch Name
de_de: Zweigname

source: Cancel
de_de: Stornieren

source: Company Name
de_de: Name der Firma

source: Contact No
de_de: Kontakt Nr

source: Edit Company Details
de_de: Geben Sie die Firmendaten ein

source: Enter Address
de_de: Adresse eingeben

source: Enter Bank Account Number
de_de: Geben Sie die Bankkontonummer ein

source: Enter Bank Name
de_de: Geben Sie den Banknamen ein

source: Enter Branch IFSC
de_de: Geben Sie die Zweigstelle IFSC ein

source: Enter Branch Name
de_de: Geben Sie den Filialnamen ein

source: Enter Comapny Name
de_de: Geben Sie den Firmennamen ein

source: Enter Contact No
de_de: Geben Sie die Kontaktnummer ein

source: Enter Email Id
de_de: Geben Sie die E-Mail-ID ein

source: Enter GST No
de_de: Geben Sie die GST-Nr. ein

source: Enter Owner Name
de_de: Geben Sie den Besitzernamen ein

source: Enter Sub Company Name
de_de: Geben Sie den Namen der Unterfirma ein

source: Enter UPI Number
de_de: Geben Sie die UPI-Nummer ein

source: Enter Website
de_de: Geben Sie die Website ein

source: GST No
de_de: GST-Nr

source: Owner Name
de_de: Besitzername

source: Sub Company Name
de_de: Name des Unterunternehmens

source: Update
de_de: Aktualisieren

source: UPI Number
de_de: Upi-Nummer

source: Website
de_de: Webseite
